20241123T012402--kdoc-305-加算と左ビットシフトの実行速度を計測する__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-11T23:09:35Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 305: 加算と左ビットシフトの実行速度を計測する</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 305: 加算と左ビットシフトの実行速度を計測する</h1>
<div id="outline-container-orgc520470" class="outline-2">
<h2 id="orgc520470"><a href="#orgc520470">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgc520470">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-23 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-30 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8a45221" class="outline-2">
<h2 id="org8a45221"><a href="#org8a45221">概要</a></h2>
<div class="outline-text-2" id="text-org8a45221">
<div class="org-src-container">
<pre class="src src-nil">42 + 42
42 * 2
</pre>
</div>

<p>
は、どちらが早いだろうか。これは言い換えると加算命令と左ビットシフトはどちらが早いか、ということになる。Go言語のベンチマークツールで加算命令と左ビットシフトの実行速度を計測する。
</p>

<p>
まず、命令がコンパイラによって省略されないように調整する。デフォルトの挙動だと、使用されない変数はコンパイル結果から省かれるため <code>//go:noinline</code> が必要。乗算は2の倍数なので、左ビットシフト演算に変換されている。
</p>

<iframe width="800px" height="400px" src="https://godbolt.org/e#g:!((g:!((g:!((h:codeEditor,i:(filename:'1',fontScale:14,fontUsePx:'0',j:1,lang:go,selection:(endColumn:9,endLineNumber:7,positionColumn:9,positionLineNumber:7,selectionStartColumn:9,selectionStartLineNumber:7,startColumn:9,startLineNumber:7),source:'//+Type+your+code+here,+or+load+an+example.%0A//+Your+function+name+should+start+with+a+capital+letter.%0Apackage+main%0A%0Afunc+main()+%7B%0A%09_+%3D+add(42)%0A%09_+%3D+shl(42)%0A%7D%0A%0A//go:noinline%0Afunc+add(a+int)+int+%7B%0A%09return+a+%2B+a%0A%7D%0A%0A//go:noinline%0Afunc+shl(a+int)+int+%7B%0A%09return+a+*+2%0A%7D%0A'),l:'5',n:'0',o:'Go+source+%231',t:'0')),k:50,l:'4',n:'0',o:'',s:0,t:'0'),(g:!((h:compiler,i:(compiler:gl1232,filters:(b:'0',binary:'1',binaryObject:'1',commentOnly:'0',debugCalls:'1',demangle:'0',directives:'0',execute:'1',intel:'1',libraryCode:'0',trim:'0',verboseDemangling:'0'),flagsViewOpen:'1',fontScale:14,fontUsePx:'0',j:1,lang:go,libs:!(),options:'',overrides:!(),selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:1),l:'5',n:'0',o:'+x86-64+gc+1.23.2+(Editor+%231)',t:'0')),k:50,l:'4',n:'0',o:'',s:0,t:'0')),l:'2',n:'0',o:'',t:'0')),version:4"></iframe>

<p>
次に、↑で確認したコードによってテストファイルを作成する。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>bench_test.go</label><pre class="src src-go">package main

import "testing"

func BenchmarkAdd(b *testing.B) {
	for i := 0; i &lt; b.N; i++ {
		_ = add(42)
	}
}

func BenchmarkShl(b *testing.B) {
	for i := 0; i &lt; b.N; i++ {
		_ = shl(42)
	}
}

//go:noinline
func add(a int) int {
	return a + a
}

//go:noinline
func shl(a int) int {
	return a * 2
}
</pre>
</div>

<p>
100回分ベンチマークを実行し、結果を保存する。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>ベンチマークを保存する</label><pre class="src src-shell">go test -bench . -benchmem -count 100 &gt; exec.log
</pre>
</div>

<p>
複数回取得したベンチマーク結果をbenchstatによってまとめて見る。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>benchstatの実行と結果</label><pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">benchstat&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;
</span>go install golang.org/x/perf/cmd/benchstat@latest
<span class="org-comment-delimiter"># </span><span class="org-comment">100&#22238;&#20998;&#12398;&#35336;&#28204;&#32080;&#26524;&#12434;&#12414;&#12392;&#12417;&#12427;
</span>benchstat exec.log

(&#30053;)
goos: linux
goarch: amd64
pkg: playground/at-2024-11-22-223539
cpu: 12th Gen Intel(R) Core(TM) i7-1260P
            &#9474;   exec.log   &#9474;
            &#9474;    sec/op    &#9474;
Add-16        0.4828n &#177; 0%
Shl-16        0.4969n &#177; 1%
(&#30053;)
</pre>
</div>

<p>
ということで、0.1ナノ秒、加算の方が早い。さらに、左ビットシフト演算は加算より計算時間にややばらつきがあることを確認した。
</p>
</div>
</div>
<div id="outline-container-orgcb8562e" class="outline-2">
<h2 id="orgcb8562e"><a href="#orgcb8562e">関連</a></h2>
<div class="outline-text-2" id="text-orgcb8562e">
<ul class="org-ul">
<li><a href="20241122T231155--kdoc-304-加算と乗算どちらが早いか__permanent.html#ID-20241122T231155">KDOC 304: 加算と乗算どちらが早いか?</a>。確認したきっかけとなる疑問</li>
</ul>
</div>
</div>
<div id="outline-container-orgeeb3a2f" class="outline-2">
<h2 id="orgeeb3a2f"><a href="#orgeeb3a2f">Backlinks</a></h2>
<div class="outline-text-2" id="text-orgeeb3a2f">
<ul class="org-ul">
<li><a href="./20241123T090824--kdoc-307-乗算と左ビットシフトの実行速度を計測する__permanent.html">KDOC 307: 乗算と左ビットシフトの実行速度を計測する</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
